# Duplicate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..Duplicate Method
ColorFillScheme Class See Also
---
Generates a copy of current scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId Duplicate(
	string name
)
```

Visual Basic
---
```text
Public Function Duplicate ( _
	name As String _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ Duplicate(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The desired name of copied scheme.
# ### Return Value
The id of copied scheme.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The name is not valid for new generated scheme. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace